app/views/kids/index.html.erb

		      <td><%= kid.bookid %></td>
		      <td><% if !(kid.bookid.blank?)%><%=kid.updated_at.strftime("%m/%d/%y")%><%end%></td>
---
SELECT "kids".* FROM "kids"