app/controllers/books_controller.rb

	  def index
    @books = Book.all
---
SELECT "books".* FROM "books"

def create
  @book = Book.new(book_params)

  if @book.save
---
INSERT INTO "books" ("bookid", "title", "author", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["bookid", 9], ["title", "aaa"], ["author", "mee"], ["description", "nnmbm"], ["created_at", "2018-02-20 13:43:10.041275"], ["updated_at", "2018-02-20 13:43:10.041275"]]

def update
  @book = Book.find(params[:id])

  if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "aaaaaa"], ["author", "meess"], ["updated_at", "2018-02-20 14:11:23.107338"], ["id", 1]]

 def destroy
  @book = Book.find(params[:id])
  @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]