app/controllers/kids_controller.rb

  def index
    @kids = Kid.all
---
SELECT "kids".* FROM "kids"

  def show
    @kid = Kid.find(params[:id])
---
SELECT  "kids".* FROM "kids" WHERE "kids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
  @kid = Kid.find(params[:id])
---
SELECT  "kids".* FROM "kids" WHERE "kids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def create
  @kid = Kid.new(kid_params)

  @kid.save
---
INSERT INTO "kids" ("studentname", "address", "section", "bookid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["studentname", "aa"], ["address", "bb"], ["section", "cc"], ["bookid", 1], ["created_at", "2018-02-21 05:34:05.184929"], ["updated_at", "2018-02-21 05:34:05.184929"]]

def update
  @kid = Kid.find(params[:id])

  if @kid.update(kid_params)
---
SELECT  "kids".* FROM "kids" WHERE "kids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "kids" SET "studentname" = ?, "address" = ?, "section" = ?, "bookid" = ?, "updated_at" = ? WHERE "kids"."id" = ?  [["studentname", "Paul Louis"], ["address", "Address"], ["section", "Section"], ["bookid", 4], ["updated_at", "2018-02-21 10:08:09.614459"], ["id", 4]]

def destroy
  @kid = Kid.find(params[:id])
  @kid.destroy
---
SELECT  "kids".* FROM "kids" WHERE "kids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "kids" WHERE "kids"."id" = ?  [["id", 1]]